{
  "sections": {
    "main": {
      "type": "main-page",
      "settings": {
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "16471557332c528230": {
      "type": "collapsible-content",
      "blocks": {
        "16471557339ac92349-0": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Salvation",
            "icon": "none",
            "row_content": "<p>Have you come to a place in your life that you know for certain you have eternal life and will go to heaven when you die?Suppose you were standing before God right now and He asked you, \"Why should I let you into heaven?\" What would you say?God's Purpose<\/p><p>God loves us and has a purpose for our lives. The Bible states it this way: \"For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%203.16\" target=\"_blank\">John 3:16<\/a>). God's purposee is that we have eternal life.<\/p><p>God gives eternal life as a gift (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%206.23\" target=\"_blank\">Romans 6:23<\/a>).We can live a full and meaningful life right now (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2010.10\" target=\"_blank\">John 10:10<\/a>).We will spend eternity with Jesus in heaven (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2014.3\" target=\"_blank\">John 14:3<\/a>).Our Need<\/p><p>As we search for meaning in life, we discover our sinful nature keeps us from fulfilling God's purpose for our lives.<\/p><p>We are all sinners by nature and by choice. \"For all have sinned and fall short of the glory of God\"(<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%203.23\" target=\"_blank\">Romans 3:23<\/a>).We cannot save ourselves \"It is by grace you have been saved, through faith–and this not from yourselves, it is the gift of God–not by works, so that no one can boast\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%202.8-9\" target=\"_blank\">Ephesians 2:8-9<\/a>).We deserve death and hell. \"The wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%206.23\" target=\"_blank\">Romans 6:23<\/a>)God's Provision<\/p><p>God is holy and just and must punish sin. Yet He loves us and provides forgiveness for our sin. Jesus said \"'I am the way and the truth and the life. No one comes to the Fatherrr except through me'\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2014.6\" target=\"_blank\">John 14:6<\/a>).<\/p><p>Jesus is God and became man (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%201.1\" target=\"_blank\">John 1:1<\/a>,<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%201.14\" target=\"_blank\">14<\/a>)Jesus died for us on the cross (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20Pet%203.18\" target=\"_blank\">1 Peter 3:18<\/a>)Jesus was resurrected (arose) from the dead and is alive today (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%204.25\" target=\"_blank\">Romans 4:25<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Romans%206.9-10\" target=\"_blank\">6:9-10<\/a>)God, through His Holy Spirit, calls us to Himself (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%206.44\" target=\"_blank\">John 6:44<\/a>)Our Response<\/p><p>The only way Jesus can affect our lives is for us to receive Him. The Bible says \"Yet to all who received him, to those who believed in his name, he gave the right to become children of God.\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John1.12\" target=\"_blank\">John1:12<\/a>)<\/p><p>We must repent of our sin \"Repent, then, and turn to God, so that your sins may be wiped away\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%203.19\" target=\"_blank\">Acts 3:19<\/a>).Repentance is not just feeling sorry for our sins (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%2026.20\" target=\"_blank\">Acts 26:20<\/a>)Repentance is turning away from our sin and turning to God through Jesus.We must place our faith in Jesus \"For it is by grace you have been saved, through faith–and this not from yourselves, it is the gift of God\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%202.8\" target=\"_blank\">Ephesians 2:8<\/a>).Faith is not just believing facts about Jesus (<a href=\"https:\/\/biblia.com\/bible\/nlt\/James%202.19\" target=\"_blank\">James 2:19<\/a>).Faith is trusting in Jesus (<a href=\"https:\/\/biblia.com\/bible\/nlt\/James%202.19\" target=\"_blank\">James 2:19<\/a>).We must surrender to Jesus as Lord. \"That if you confess with your mouth, 'Jesus is Lord,' and believe in your heart that God raised him from the dead, you will be saved. For it is with your heart that you believe and are justified, and it is with your mouth that you confess and are saved\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2010.9-10\" target=\"_blank\">Romans 10:9-10<\/a>).Surrendering to Jesus as Lord is not just saying we give our lives to Jesus (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Matt%207.21\" target=\"_blank\">Matthew 7:21<\/a>).Surrendering to Jesus as Lord is giving Jesus control of our lives.My Commitment<\/p><p>Giving Jesus controle is something each person must do for himself or herself. No onne else can make this decision for you. Jesus says,\"'Here I am! I stand at the door and knock. If anyone hears my voice and opens the door, I will come in and eat with him, and he with me'\" (Revelations 3:20).<\/p><p>Does what we have been discussing make sense to you?Is there any reason you would not be willing to receive God's gift of eternal life?Are you willing to turn from your sin, place your faith in Jesus, and give Him control of your life right now? If not<a href=\"https:\/\/equippdlife.com\/contact\">contact us<\/a>and we can help answer any questions you may have.<\/p><p>If you are willing to receive Jesus into your life now, you can invite Him in by prayer. You may use the following prayer or a similar one using your own words:<\/p><p>Dear Lord Jesus, I believe You are the Son of God and died to forgive me of my sins. I know I have sinned. I ask You to forgive me. I turn from my sins, and I receive you as Lord and Savior. Thank you for saving me. I want to live for You the rest of my life from this day forward. Amen.<\/p>",
            "page": ""
          }
        },
        "16471557339ac92349-1": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Baptism",
            "icon": "none",
            "row_content": "<p>Have you been baptized by immersion since receivinng Jesus as Lord and Savior?<\/p><p>Baptism is a response of obedience to Jesus Christ as Lord (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.38\" target=\"_blank\">Acts 2:38<\/a>,<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.41\" target=\"_blank\">41<\/a>). Although baptism does not save, it demonstrates our recognition of the lordship of Jesus over every aspect of our lives. \"Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything I have commanded you. And surely I am with you always, to the very end of the age\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Matt%2028.19-20\" target=\"_blank\">Matthew 28:19-20<\/a>).<\/p><p>God's PurposeWe declare our new life in Christ through baptism (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.41\" target=\"_blank\">Acts 2:41<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%208.35-38\" target=\"_blank\">8:35-38<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%2016.25-34\" target=\"_blank\">16:25-34<\/a>)The death, burial, and resurrection of Jesus, as well as our own spiritual death, burial, and resurrection, are portrayed in baptism (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%206.3-5\" target=\"_blank\">Romans 6:3-5<\/a>).Our NeedWe need to confess Jesus publicly through baptism soon after we are saved (Matthew 10:32).We need to obey Jesus' command (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Matt%2028.19\" target=\"_blank\">Matthew 28:19<\/a>).We need to follow Jesus' example (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Matt%203.13-15\" target=\"_blank\">Matthew 3:13-15<\/a>).We need to join the fellowship of the church family (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.41\" target=\"_blank\">Acts 2:41<\/a>).God's ProvisionJesus began His public ministry with baptism (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Mark%201.9-11\" target=\"_blank\">Mark 1:9-11<\/a>).Jesus demonstrated that immersion in water (being placed under water) is the proper way to be baptized (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Mark%201.10\" target=\"_blank\">Mark 1:10<\/a>).Jesus has given authority to His followers to baptize (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Mark%2028.19\" target=\"_blank\">Mark 28:19<\/a>).Our ResponseRequest a local church to baptize you.Be baptized as an expression as an expression of obedience to Jesus (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.41\" target=\"_blank\">Acts 2:41<\/a>)Influence others through your baptism (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%2016.31-33\" target=\"_blank\">Acts 16:31-33<\/a>).My Commitment<\/p><p>In summary, the essentials of baptism are:<\/p><p>Believe in Jesus for salvation.Ask a local church for baptismBe immersed in water, showing your identification with Jesus and His church.<\/p><p>If you are willing to take this step of public commitment to Jesus, you can express that willingness through the following or a similar prayer:<\/p><p>\"Father, I want to obey You and let others know I have a new life in Jesus Christ. Bless me as I follow Jesus in baptism.\"<\/p>",
            "page": ""
          }
        },
        "16471557339ac92349-2": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Church Membership",
            "icon": "none",
            "row_content": "<p>Are you an active member of a local church? Where? Jesus built the church (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Matt%2016.18\" target=\"_blank\">Matthew 16:18<\/a>) and gave Himself for the benefit of the church (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%205.25\" target=\"_blank\">Ephesians 5:25<\/a>). The church is made up of God's people. To love Jesus is to love His church.<\/p><p>God's Purpose<\/p><p>We can be a part of God's work through the church. \"So in Christ we who are many form one body, and each member belongs to all the others\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2012.5\" target=\"_blank\">Romans 12:5<\/a>).<\/p><p>As a part of the church, we can worship with other Christians (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Heb%2010.25\" target=\"_blank\">Hebrews 10:25<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%205.19-20\" target=\"_blank\">Ephesians 5:19-20<\/a>).As a part of the church, we can evangelize, that is, share our faith (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%201.8\" target=\"_blank\">Acts 1:8<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Cor%205.18-20\" target=\"_blank\">2 Corinthians 5:18-20<\/a>).As a part of the church, we can grow in discipleship to become the kind of people God wants us to be (<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Pet%203.18\" target=\"_blank\">2 Peter 3:18<\/a>).As a part of the church, we can minister to one another (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20Cor%2012.12-26\" target=\"_blank\">1 Corinthians 12:12-26<\/a>).As a part of the church, we can fellowship with one another (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Heb%2010.24-25\" target=\"_blank\">Hebrews 10:24-25<\/a>).<\/p><p>Our Need<\/p><p>We need to identify publicly with the family of God (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.41-42\" target=\"_blank\">Acts 2:41-42<\/a>).We need strength for daily living, which comes through fellowship with other Christians (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Heb%203.13\" target=\"_blank\">Hebrews 3:13<\/a>).We need to express our personal talents and spiritual gifts in service through the church (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2012.4-8\" target=\"_blank\">Romans 12:4-8<\/a>).God's ProvisionGod established the church as the body of Christ (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%204.4\" target=\"_blank\">Ephesians 4:4<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Col%201.18\" target=\"_blank\">Colossians 1:18<\/a>).God provides for church membership through the invitation of the local church (Revelations 22:17).God encourages every Christian to participate in church membership (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Heb%2010.25\" target=\"_blank\">Hebrews 10:25<\/a>). Jesus set the example for us through His custom of regular synagogue attendance (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Luke%204.16\" target=\"_blank\">Luke 4:16<\/a>).<\/p><p>Our Response<\/p><p>You may become a member of the local church fellowship by professing your faith and by being baptized (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.41\" target=\"_blank\">Acts 2:41<\/a>,<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%202.47\" target=\"_blank\">47<\/a>).You may share the fellowship of the local church by joining its membership.You may join a church by a statement that you have been baptized by a local of like beliefs and practices.<\/p><p>My Commitment<\/p><p>If you are ready to make the commitment to join the fellowship of the local church, let us assist you in finding a local church of your choice. Seal your commitment in a prayer similar to the following:<\/p><p>Dear Lord, thank you for the church, and particularly for this local church. Help me to be a faithful church member and support my church family.<\/p>",
            "page": ""
          }
        },
        "16471557339ac92349-3": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Assurance of Salvation",
            "icon": "none",
            "row_content": "<p>Do you doubt your salvation?<\/p><p>God's Purpose<\/p><p>God wants us to know we have eternal life. The Bible says, \"He who has the Son has life; he who does not have the Son of God does not have life. I write these things to you who believe in the name of the Son of God so that you may know that you have eternal life\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20John%205.12-13\" target=\"_blank\">1 John 5:12-13<\/a>). God wants us to experience the joy of salvation (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2015.10-11\" target=\"_blank\">John 15:10-11<\/a>).<\/p><p>Our Need<\/p><p>Doubts are not uncommen to Christians. Satan wants us to doubt and may plant doubts in our minds (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Gen%203.1\" target=\"_blank\">Genesis 3:1<\/a>). Even the biblical writers experienced doubts and expressed the need for renewal (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Ps%2051.12\" target=\"_blank\">Psalms 51:12<\/a>). There are five major factors which cause believers to doubt:<\/p><p>You may not have received adequate explanation when you first believed.You may have neglected prayer, Bible study, and worship.You may have allowed sin, disobedience, or a failure to share your faith to cloud your relationship with Jesus.You may have inadequate or erroneous understanding about God or about your daily Christian life.You may be experiencing physical or emotional difficulties which are causing you to doubt your salvation.God's ProvisionGod has promised to complete His work of salvation in us (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Phil%201.6\" target=\"_blank\">Philippians 1:6<\/a>).Jesus promises assurance of eternal life: \"Whoever hears my word and believes him who sent me has eternal life and will not be condemned; he has crossed over from death to life\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%205.24\" target=\"_blank\">John 5:24<\/a>).Jesus said no one could take the Christian out of His hand (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2010.28\" target=\"_blank\">John 10:28<\/a>).The Holy Spirit tells us we are the children of God (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%208.16\" target=\"_blank\">Romans 8:16<\/a>).Our Response<\/p><p>We receive God's assurance by faith and express it through obedience (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20John%202.3-5\" target=\"_blank\">1 John 2:3-5<\/a>). Christians are not to trust only their feelings. We walk by faith, not by sight (<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Cor%205.7\" target=\"_blank\">2 Corinthians 5:7<\/a>). Four actions can bring us to assurance:<\/p><p>Confess all known sin \"If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20John%201.9\" target=\"_blank\">1 John 1:9<\/a>).Commit yourself to the lordship of Jesus Christ (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2010.9-10\" target=\"_blank\">Romans 10:9-10<\/a>).Claim God's promise of salvation by faith. Know. Believe. Entrust. (<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Tim%201.12\" target=\"_blank\">2 Timothy 1:12<\/a>).Obey God's commands (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2014.21\" target=\"_blank\">John 14:21<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2015.10\" target=\"_blank\">15:10<\/a>).My Commitment<\/p><p>Are you ready to take the four faith actions which bring assurance of salvation? If so, you may want to pray the following or a similar prayer now:<\/p><p>\"Father, I place my complete faith in you: I confess to you any sin (you may want to name known sins here); I commit myself to the lordship of Jesus; I claim your promise of assurance; and I will live in obedience to your commands. Thank you for the assurance of my salvation.\"<\/p>",
            "page": ""
          }
        },
        "1fe17b36-c952-4c54-af26-0ff784f54fc5": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Rededication",
            "icon": "none",
            "row_content": "<p>You may feel you are not as close to Jesus as you once were, or you may realize you are not continuing to grow toward spiritual maturity.<\/p><p>God's Purpose<\/p><p>Jesus wants to be Lord of all your life (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Luke%206.46\" target=\"_blank\">Luke 6:46<\/a>). God wants your life to be useful and joyful (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2015.10-11\" target=\"_blank\">John 15:10-11<\/a>). God wants you to live in fellowship with Him (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20John%201.7\" target=\"_blank\">1 John 1:7<\/a>). God wants to fill you with His Spirit (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%205.%2018\" target=\"_blank\">Ephesians 5: 18<\/a>). God wants to equip you for ministry (<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Tim%203.16-17\" target=\"_blank\">2 Timothy 3:16-17<\/a>). When you fail in your walk with Him, God wants to forgive you and restore you to a useful life with Him (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20John%201.9\" target=\"_blank\">1 John 1:9<\/a>).<\/p><p>Our Need<\/p><p>Personal sin may hinder our fellowship with God (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Isa%2059.2\" target=\"_blank\">Isaiah 59:2<\/a>). Circumstances of life may reveal a need for renewed or coninuing growth toward maturity (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2012.1-2\" target=\"_blank\">Romans 12:1-2<\/a>).<\/p><p>God's Provision<\/p><p>God offers six major resources for transformation and spiritual growth.<\/p><p>God uses scripture to bring believers into a state of being set apart for His purposes (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2017.17\" target=\"_blank\">John 17:17<\/a>). Spiritual disciplines, such as prayer, Bible study, worship, fasting, witnessing, and serving help us to grow(<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20Tim%204.7\" target=\"_blank\">1 Timothy 4:7<\/a>). Family and home influences may encourage us toward spiritual growth (<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Tim%201.5\" target=\"_blank\">2 Timothy 1:5<\/a>). The church, as the body of Christ, encourages all to reach unity in their faith and knowledge of Jesus (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%204.12-13\" target=\"_blank\">Ephesians 4:12-13<\/a>). God works in all circumstances of life to bring us to Christlikeness (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%208.28-29\" target=\"_blank\">Romans 8:28-29<\/a>). God disciplines His children to transform us into the likeness of Jesus (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Heb%2012.10\" target=\"_blank\">Hebrews 12:10<\/a>).<\/p><p>Our Response<\/p><p>Confess any known sin (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Prov%2028.13\" target=\"_blank\">Proverbs 28:13<\/a>).Recommit your life to the lordship of Jesus Christ (<a href=\"https:\/\/biblia.com\/bible\/nlt\/John%2020.28\" target=\"_blank\">John 20:28<\/a>). Yield yourself daily to Jesus and experience the fullness of His life in you as you continually grow toward spiritual maturity (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%206.12-13\" target=\"_blank\">Romans 6:12-13<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Gal%202.20\" target=\"_blank\">Galatians 2:20<\/a>).<\/p><p>My Commitment<\/p><p>As you respond to God's call to growth, you will begin to see the fruit of the Spirit being developed in your life (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Gal%205.22-23\" target=\"_blank\">Galatians 5:22-23<\/a>).<\/p><p>Perhaps you can identify one or more aspects of the fruit of the Spirit which are lacking in your life. Are you ready to ask God to work in you to help you grow toward the fullness of His life? If so, you may want to pray the following prayer or a similar one:<\/p><p>\"Heavenly Father, I want to be like Jesus. I commit myself to you and ask you to work in my life to develop the fruit of the Spirit so I may become continually more mature in my faith. Amen.\"<\/p>",
            "page": ""
          }
        },
        "7da9228d-03fc-4c1a-995d-dc7be1b6b000": {
          "type": "collapsible_row",
          "settings": {
            "heading": "Ministry",
            "icon": "none",
            "row_content": "<p>What do you think God wants you to do with your life? God wants you to know His will (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%205.17\" target=\"_blank\">Ephesians 5:17<\/a>), and He will help you discover it (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2012.2\" target=\"_blank\">Romans 12:2<\/a>).<\/p><p>God's Purpose<\/p><p>Every Christian is called to ministry, that is, to Christian service (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%204.1\" target=\"_blank\">Ephesians 4:1<\/a>). God reaches out through His people to the world (<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Cor%205.20\" target=\"_blank\">2 Corinthians 5:20<\/a>). God gives us spiritual gifts to minister to others (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2012.6\" target=\"_blank\">Romans 12:6<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20Pet%204.10\" target=\"_blank\">1 Peter 4:10<\/a>). God gives leaders to the church to equip its people for ministry: \"It was he who gave some to be apostles, some to be prophets, some to be evangelists, and some to be pastors and teachers, to prepare God's people for works of service, so that the body of Christ may be built up\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Eph%204.11-12\" target=\"_blank\">Ephesians 4:11-12<\/a>).<\/p><p>Our Need<\/p><p>We need to be laborers in the fields that are ready for harvest (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Luke%2010.2\" target=\"_blank\">Luke 10:2<\/a>). We need to sense an urgency of sharing the gospel because so many in the world are lost and headed for eternity in hell (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Matt%207.13\" target=\"_blank\">Matthew 7:13<\/a>). We need to obey the will of God as He reveals it \"For it is God who works in you to will and to act according to his good purpose\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Phil%202.13\" target=\"_blank\">Philippians 2:13<\/a>). We need to equip others for service (<a href=\"https:\/\/biblia.com\/bible\/nlt\/2%20Tim%202.2\" target=\"_blank\">2 Timothy 2:2<\/a>). God's ProvisionGod will equip you for the ministry He gives you (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Phil%202.13\" target=\"_blank\">Philippians 2:13<\/a>). It is God who calls you to Christian service (<a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20Sam%203.8-9\" target=\"_blank\">1 Samuel 3:8-9<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%209.1-20\" target=\"_blank\">Acts 9:1-20<\/a>). God promises to be with you and to strengthen you (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Exod%204.12\" target=\"_blank\">Exodus 4:12<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Josh%201.9\" target=\"_blank\">Joshua 1:9<\/a>). The Holy Spirit will empower you (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Acts%201.8\" target=\"_blank\">Acts 1:8<\/a>). Anything He leads you to do is possible in His strength: \"I can do everything through him who gives me strength\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Phil%204.13\" target=\"_blank\">Philippians 4:13<\/a>).<\/p><p>Our Response<\/p><p>Discover God's will for service by completely surrendering to Jesus as Lord (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Rom%2012.1-2\" target=\"_blank\">Romans 12:1-2<\/a>). Commit yourself to doing what God directs you to do (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Luke%205.5\" target=\"_blank\">Luke 5:5<\/a>;<a href=\"https:\/\/biblia.com\/bible\/nlt\/Luke%209.23\" target=\"_blank\">9:23<\/a>). Trust God for guidance. \"Trust in the Lord with all of your heart and lean not on your own understanding, in all your ways acknowledge him, and he will make your paths straight\" (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Prov%203.5-6\" target=\"_blank\">Proverbs 3:5-6<\/a>).<\/p><p>My Commitment<\/p><p>Are you willing to do God's will? If you are, He will reveal His will to you, a step at a time.<\/p><p>Will you respond to each step as God reveals it and trust Him for the next steps?<\/p><p>Your first step is to serve faithfully where you are (<a href=\"https:\/\/biblia.com\/bible\/nlt\/Matt%2025.21\" target=\"_blank\">Matthew 25:21<\/a>; <a href=\"https:\/\/biblia.com\/bible\/nlt\/1%20Cor%204.2\" target=\"_blank\">1 Corinthians 4:2<\/a>).<\/p><p>If you are willing to commit yourself to following God's will for all of your life, you may want to pray the following or a similar prayer:<\/p><p>Dear Lord, thank You for providing a perfect plan for my life. I am committed to obeying Your will as You reveal it to me.<\/p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "16471557339ac92349-0",
        "16471557339ac92349-1",
        "16471557339ac92349-2",
        "16471557339ac92349-3",
        "1fe17b36-c952-4c54-af26-0ff784f54fc5",
        "7da9228d-03fc-4c1a-995d-dc7be1b6b000"
      ],
      "settings": {
        "caption": "",
        "heading": "",
        "heading_alignment": "center",
        "layout": "none",
        "color_scheme": "background-1",
        "container_color_scheme": "background-2",
        "open_first_collapsible_row": false,
        "image_ratio": "adapt",
        "desktop_layout": "image_second",
        "padding_top": 0,
        "padding_bottom": 36
      }
    },
    "newsletter": {
      "type": "newsletter",
      "blocks": {
        "newsletter-0": {
          "type": "heading",
          "settings": {
            "heading": "Speak Truth In Love. Grow More Like Christ."
          }
        },
        "newsletter-1": {
          "type": "paragraph",
          "settings": {
            "text": "<p>Stay up to date with everything going on to be notified when new studies are released.<\/p>"
          }
        },
        "newsletter-2": {
          "type": "email_form",
          "settings": {
          }
        }
      },
      "block_order": [
        "newsletter-0",
        "newsletter-1",
        "newsletter-2"
      ],
      "settings": {
        "color_scheme": "accent-1",
        "full_width": true,
        "padding_top": 64,
        "padding_bottom": 52
      }
    }
  },
  "order": [
    "main",
    "16471557332c528230",
    "newsletter"
  ]
}